DROP TABLE IF EXISTS restaurants;

CREATE TABLE restaurants (
    id SERIAL PRIMARY KEY,
    name VARCHAR(100),
    lon double precision,
    lat double precision
);

INSERT INTO restaurants (name, lon, lat) VALUES
('هانی', 51.3929165, 35.6933312),
('فست فود حس', 51.3933976, 35.6908018),
('کبابی حس', 51.3929569, 35.6970569),
('رستوران بهار', 51.3944058, 35.6908059),
('رستوران بهاران', 51.3921064, 35.6969341),
('آشپزخانه بهار', 51.3942608, 35.6971622),
('کبابی بهار', 51.3929165, 35.6933312),
('فست فود بهار', 51.3933976, 35.6908018),
('رستوران بهار', 51.3929569, 35.6970569),
('رستوران بهاران', 51.3944058, 35.6908059),
('آشپزخانه بهار', 51.3921064, 35.6969341),
('کبابی بهار', 51.3942608, 35.6971622),
('فست فود بهار', 51.3929165, 35.6933312),
('رستوران بهار', 51.3942608, 35.6971622);

SELECT * FROM restaurants;
